[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [dev / acme-demo simple-ec2-instance ](https://app.env0.com/p/cd11f372-4ed1-4214-8029-96f2eb0babc0/environments/c80bc11d-1eb2-45fa-a591-69ffd3c5d439):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-04f5a6a7ecc99fbe2" -> "ami-0bf3fc7dfe888c036" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-04dd5c8bf9fde9c39" -> (known after apply)
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-04dd5c8bf9fde9c39" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0130728d224521c49" -> (known after apply)
!       private_dns                          = "ip-10-0-3-163.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.163" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "35.94.229.241" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"                = "March 18" -> "April 1"
            "Name"                = "env0-acme-ec2"
            "Owner"               = "acme demo org"
            "Terraform"           = "true"
            "Test"                = "new tag"
            "env0_environment_id" = "c80bc11d-1eb2-45fa-a591-69ffd3c5d439"
            "env0_project_id"     = "cd11f372-4ed1-4214-8029-96f2eb0babc0"
        }
!       tags_all                             = {
!           "Demo"                = "March 18" -> "April 1"
            # (6 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

!       ebs_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       enclave_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       ephemeral_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       metadata_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       network_interface {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       root_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-04dd5c8bf9fde9c39",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.163",
+       (known after apply),
    ]
!   public_ip  = [
-       "35.94.229.241",
+       (known after apply),
    ]
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/cd11f372-4ed1-4214-8029-96f2eb0babc0/environments/c80bc11d-1eb2-45fa-a591-69ffd3c5d439/deployments/780ba47a-2d63-41fe-81f4-a84faa7793c1)
